<?php
require_once ('StatementSheet.php');

$sheet = new StatementSheet();

$sheet->setGrades('Иванов Петр Семенович', ['Русский язык' => 5, 'Алгебра' => 5, 'Химия' => 5 ] );
$sheet->setGrades('Петров Иван Сидорович', ['Русский язык' => 5, 'Алгебра' => 4, 'История' => 2 ] );
$sheet->setGrades('Пушкин Александр Сергеевич', ['Русский язык' => 3, 'Алгебра' => 5, 'Физика' => 2 ] );
$sheet->setGrades('Семенов Сидор Петрович', ['Русский язык' => 3, 'Алгебра' => 4, 'Физика' => 5] );
$sheet->setGrades('Иванов Иван Иванович', ['Русский язык' => 3, 'Алгебра' => 3, 'Физика' => 3] );
$sheet->setGrades('Петров Петр Петрович', ['Русский язык' => 2, 'Алгебра' => 4, 'Физика' => 2] );
$sheet->setGrades('Сидоров Сидор Сидорович', ['Русский язык' => 2, 'Алгебра' => 4, 'Физика' => 5] );

echo $sheet->printTable();
echo '-------------------------------'.PHP_EOL;
echo $sheet->getPerfectStudents();
echo '-------------------------------'.PHP_EOL;
echo $sheet->getMiddleStudents();
echo '-------------------------------'.PHP_EOL;
echo $sheet->getBadStudents();

/*
Студент;Русский язык;Алгебра;Химия;История;Физика
Иванов Петр Семенович;5;5;5;;;
Петров Иван Сидорович;5;4;;2;;
Пушкин Александр Сергеевич;3;5;;;2;
Семенов Сидор Петрович;3;4;;;5;
Иванов Иван Иванович;3;3;;;3;
Петров Петр Петрович;2;4;;;2;
Сидоров Сидор Сидорович;2;4;;;5;
-------------------------------
Студент;Русский язык;Алгебра;Химия;История;Физика
Иванов Петр Семенович;5;5;5;;;
-------------------------------
Студент;Русский язык;Алгебра;Химия;История;Физика
Пушкин Александр Сергеевич;3;5;;;2;   --  этот студент попадает под условие:студенты, которые имеют только одну тройку по любому предмету
Семенов Сидор Петрович;3;4;;;5;
-------------------------------
Студент;Русский язык;Алгебра;Химия;История;Физика
Петров Петр Петрович;2;4;;;2;
 */